Kaggle- Titanic

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [4]:
df_train = pd.read_csv("train.csv")
df_test = pd.read_csv("test.csv")
if 'Survived' not in df_test.columns:
    df_test['Survived'] = 0

In [5]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [55]:
def PreProcess(df_train,df_test):
    df = pd.concat([df_train,df_test],axis=0)
    df = df.drop(['Name','Ticket'],axis=1)
    df['Age'] = df['Age'].fillna(df['Age'].mean())
    df['Cabin'] = df['Cabin'].fillna('X000')
    df['Embarked'] = df['Embarked'].fillna('X')
    df['Fare'] = df['Fare'].fillna(df['Fare'].mean())

    df['Cabin_letter'] = df['Cabin'].str.extract(r'([a-zA-Z]+)',expand=False)
    df['Cabin_number'] = df['Cabin'].str.extract(r'(\d+)',expand=False)
    df = df.drop('Cabin',axis = 1)

    df = pd.get_dummies(df,columns=['Cabin_letter'],prefix='cabin')
    df = pd.get_dummies(df,columns=['Sex'],prefix='Sex')
    df = pd.get_dummies(df,columns=['Embarked'],prefix='Embarked')

    df = df.drop('cabin_X',axis=1)
    df = df.drop('Embarked_X',axis=1)

    df['Cabin_number'] = df['Cabin_number'].fillna(0)
    return df

In [8]:
df = pd.concat([df_train,df_test],axis = 0)
df.isna().sum()

PassengerId       0
Survived          0
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [56]:
Ref_df = PreProcess(df_train,df_test)

In [57]:
Ref_df.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Age             0
SibSp           0
Parch           0
Fare            0
Cabin_number    0
cabin_A         0
cabin_B         0
cabin_C         0
cabin_D         0
cabin_E         0
cabin_F         0
cabin_G         0
cabin_T         0
Sex_female      0
Sex_male        0
Embarked_C      0
Embarked_Q      0
Embarked_S      0
dtype: int64

In [53]:
Ref_df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Cabin_number,cabin_A,cabin_B,...,cabin_D,cabin_E,cabin_F,cabin_G,cabin_T,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.000000,1,0,7.2500,000,False,False,...,False,False,False,False,False,False,True,False,False,True
1,2,1,1,38.000000,1,0,71.2833,85,False,False,...,False,False,False,False,False,True,False,True,False,False
2,3,1,3,26.000000,0,0,7.9250,000,False,False,...,False,False,False,False,False,True,False,False,False,True
3,4,1,1,35.000000,1,0,53.1000,123,False,False,...,False,False,False,False,False,True,False,False,False,True
4,5,0,3,35.000000,0,0,8.0500,000,False,False,...,False,False,False,False,False,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,29.881138,0,0,8.0500,000,False,False,...,False,False,False,False,False,False,True,False,False,True
414,1306,0,1,39.000000,0,0,108.9000,105,False,False,...,False,False,False,False,False,True,False,True,False,False
415,1307,0,3,38.500000,0,0,7.2500,000,False,False,...,False,False,False,False,False,False,True,False,False,True
416,1308,0,3,29.881138,0,0,8.0500,000,False,False,...,False,False,False,False,False,False,True,False,False,True
417,1309,0,3,29.881138,1,1,22.3583,000,False,False,...,False,False,False,False,False,False,True,True,False,False